/*
 * mc_hardware_interface_pwm.h
 *
 *  Created on: Oct 28, 2017
 *      Author: demid
 */
#pragma once


#include <stdint.h>


namespace PWM{

class pwm_base{
public:
    //**********************************************************************
    // Метод должен:
    // 1. Отключить PWM.
    // 2. Заполнить все регистры.
    //**********************************************************************
    virtual void reinit ( void ) const = 0;

    //**********************************************************************
    // Методы должены включать/отключать PWM (не перетерая поля регистров).
    //**********************************************************************
    virtual void on     	( void )  = 0;
    virtual void off    	( void )  = 0;
    //**********************************************************************
    // устанавливает скважность шимм
    //**********************************************************************
    virtual void setDuty	( const float &duty ) const = 0;
};

}
