#pragma once

#include <stdint.h>

//**********************************************************************
// Объект для управления одной линией ввода-вывода.
// Вывод должен быть заранее настроен на выход или вход с нужными
// параметрами.
//**********************************************************************
class pin_base {
public:
    constexpr pin_base() {}

    //**********************************************************************
    // Метод устанавливает вывод в логическую единицу (VDD),
    // если вывод ранее был настроен как выход.
    //**********************************************************************
    virtual void    set     ( void )            const = 0;

    //**********************************************************************
    // Метод устанавливает вывод в логический ноль (VSS),
    // если вывод ранее был настроен как выход.
    //**********************************************************************
    virtual void    reset   ( void )            const = 0;

    //**********************************************************************
    // Метод устанавливает на выводе заданное состояние (логический ноль или
    // логическую единицу), если вывод ранее был настроен как выход.
    //**********************************************************************
    virtual void    set     ( uint8_t state )   const = 0;
    virtual void    set     ( bool state )      const = 0;
    virtual void    set     ( int state )       const = 0;

    virtual bool    read    ( void )            const = 0;

    virtual ~pin_base() {}
};
