#pragma once

//**********************************************************************
// Таймер предназначен только для генерации прямоугольных испульсов
// на одном канале.
// Модуль умеет только задвавать период испульсов, включать/отключать генерацию.
// В случае, если нужено настроить модуль на другую частоту -
// используется другой объект.
//**********************************************************************
class tim_comp_one_channel_base {
public:
    constexpr tim_comp_one_channel_base() {}

    //**********************************************************************
    // Метод должен:
    // 1. Отключить таймер.
    // 2. Заполнить все необходимые регистры.
    // Замечание: таймер при этом остается в отключенном состоянии.
    //**********************************************************************
    virtual void reinit     ( void ) const = 0;

    //**********************************************************************
    // Методы должены включать/отключать таймер
    // (не перетерая поля регистров).
    //**********************************************************************
    virtual void on         ( void ) const = 0;
    virtual void off        ( void ) const = 0;

    virtual ~tim_comp_one_channel_base() {}
};

//**********************************************************************
// Таймер предназначен только для генерации прерываний.
//**********************************************************************
class tim_interrupt_base {
public:
    constexpr tim_interrupt_base() {}

    //**********************************************************************
    // Метод должен:
    // 1. Отключить таймер.
    // 2. Заполнить все необходимые регистры.
    // Замечание: таймер при этом остается в отключенном состоянии.
    //**********************************************************************
    virtual void reinit     ( void ) const = 0;

    //**********************************************************************
    // Методы должены включать/отключать таймер
    // (не перетерая поля регистров).
    //**********************************************************************
    virtual void on         ( void ) const = 0;
    virtual void off        ( void ) const = 0;

    virtual ~tim_interrupt_base() {}
};
